//
//  Cartoon.swift
//  Movie
//
//  Created by Syn Ceokhou on 6/10/16.
//  Copyright © 2016 Syn Ceokhou. All rights reserved.
//

import Foundation

class Cartoon: NSObject {
    internal var name: String?
    internal var id: String?
    internal var info = Dictionary<String, String>()
    
    internal var videos = [Video]()
    
    internal var thumbnailURL: String?
    
    internal var thumbnailData: NSData?
        
    internal init(name: String, id: String)
    {
        self.name = name
        self.id = id
    }
    
    internal convenience init(name: String) {
        self.init(name: name,id: "")
    }
    
    internal init(name:String,id:String,info:Dictionary<String, String>)
    {
        self.name = name
        self.id = id
        self.info = info
    }
    
    class func allCartoons() -> [Cartoon]
    {
        return [Cartoon(name:"Re：从零开始的异世界生活",id:"1557",info:[ "类型":"1",
            "当前集数":"12",
            "字幕组":"EMD",
            "更新时间":"2016-06-22 17:33:26",
            "下载量":"856",
            "当前状态":"连载中",
            "本周下载量":"63",
            "评论数":"4",]),
                
                Cartoon(name:"超时空要塞Δ",id:"1551",info:["类型":"1",
                    "当前集数":"12",
                    "字幕组":"NEO·QSW",
                    "更新时间":"2016-06-22 17:32:36",
                    "下载量":"342",
                    "当前状态":"连载中",
                    "本周下载量":"22",
                    "评论数":"3", ]),
                
                Cartoon(name:"鬼牌游戏",id:"1550",info:[ "类型":"1",
                    "当前集数":"11",
                    "字幕组":"DMG",
                    "更新时间":"2016-06-22 17:32:09",
                    "下载量":"233",
                    "当前状态":"连载中",
                    "本周下载量":"21",
                    "评论数":"1",]),
                
                Cartoon(name:"文豪野犬",id:"1542",info:["类型":"1",
                    "当前集数":"11",
                    "字幕组":"极影字幕社",
                    "更新时间":"2016-06-22 17:30:25",
                    "下载量":"599",
                    "当前状态":"连载中",
                    "本周下载量":"24",
                    "评论数":"4", ]),
                
                Cartoon(name:"青春波纹",id:"1548",info:["类型":"1",
                    "当前集数":"11",
                    "字幕组":"DHR&amp;MakariHoshiyume",
                    "更新时间":"2016-06-22 17:30:12",
                    "下载量":"166",
                    "当前状态":"连载中",
                    "本周下载量":"22",
                    "评论数":"0", ]),
                
                Cartoon(name:"羁绊者",id:"1556",info:[ "类型":"1",
                    "当前集数":"11",
                    "字幕组":"KTXP",
                    "更新时间":"2016-06-22 17:29:40",
                    "下载量":"156",
                    "当前状态":"连载中",
                    "本周下载量":"47",
                    "评论数":"4",]),
                
                Cartoon(name:"JOJO的奇妙冒险 不灭钻石",id:"1549",info:[ "类型":"1",
                    "当前集数":"12",
                    "字幕组":"JOJO&amp;UHA-WING&amp;HKACG&amp;Kamigami",
                    "更新时间":"2016-06-20 19:00:45",
                    "下载量":"367",
                    "当前状态":"连载中",
                    "本周下载量":"32",
                    "评论数":"3",]),
                
                Cartoon(name:"魔奇少年 辛巴达的冒险",id:"1553",info:["类型":"1",
                    "当前集数":"10",
                    "字幕组":"KTXP",
                    "更新时间":"2016-06-20 19:00:37",
                    "下载量":"135",
                    "当前状态":"连载中",
                    "本周下载量":"25",
                    "评论数":"2", ]),
                
                Cartoon(name:"迷家[完]",id:"1554",info:["类型":"1",
                    "当前集数":"12",
                    "字幕组":"KTXP",
                    "更新时间":"2016-06-20 18:59:54",
                    "下载量":"227",
                    "当前状态":"完结",
                    "本周下载量":"23",
                    "评论数":"0", ]),
                
                Cartoon(name:"境界之轮回 第二季",id:"1552",info:[ "类型":"1",
                    "当前集数":"11",
                    "字幕组":"KTXP",
                    "更新时间":"2016-06-20 18:59:43",
                    "下载量":"90",
                    "当前状态":"连载中",
                    "本周下载量":"20",
                    "评论数":"1",]),
                
                Cartoon(name:"逆转裁判",id:"1547",info:["类型":"1",
                    "当前集数":"11",
                    "字幕组":"SumiSora",
                    "更新时间":"2016-06-15 17:11:24",
                    "下载量":"227",
                    "当前状态":"连载中",
                    "本周下载量":"27",
                    "评论数":"1", ]),
                
                Cartoon(name:"SUPER LOVERS[完]",id:"1555",info:["类型":"1",
                    "当前集数":"10",
                    "字幕组":"KTXP",
                    "更新时间":"2016-06-15 17:09:42",
                    "下载量":"295",
                    "当前状态":"完结",
                    "本周下载量":"35",
                    "评论数":"1", ]),
                
                Cartoon(name:"甲铁城的卡巴内利",id:"1546",info:["类型":"1",
                    "当前集数":"9",
                    "字幕组":"Airota",
                    "更新时间":"2016-06-11 12:00:20",
                    "下载量":"1223",
                    "当前状态":"连载中",
                    "本周下载量":"82",
                    "评论数":"11", ]),
                
                Cartoon(name:"田中君总是如此慵懒",id:"1545",info:["类型":"1",
                    "当前集数":"9",
                    "字幕组":"HYxRH",
                    "更新时间":"2016-06-11 12:00:06",
                    "下载量":"494",
                    "当前状态":"连载中",
                    "本周下载量":"17",
                    "评论数":"2", ]),
                
                Cartoon(name:"线上游戏的老婆不可能是女生？",id:"1543",info:[ "类型":"1",
                    "当前集数":"10",
                    "字幕组":"HYSUB",
                    "更新时间":"2016-06-11 11:59:56",
                    "下载量":"498",
                    "当前状态":"连载中",
                    "本周下载量":"9",
                    "评论数":"2",]),
                
                Cartoon(name:"在下坂本，有何贵干",id:"1541",info:["类型":"1",
                    "当前集数":"9",
                    "字幕组":"Mabors Sub",
                    "更新时间":"2016-06-11 11:59:22",
                    "下载量":"851",
                    "当前状态":"连载中",
                    "本周下载量":"41",
                    "评论数":"5", ]),
                
                Cartoon(name:"我的英雄学院",id:"1544",info:["类型":"1",
                    "当前集数":"4",
                    "字幕组":"HKACG",
                    "更新时间":"2016-04-26 19:44:52",
                    "下载量":"143",
                    "当前状态":"连载中",
                    "本周下载量":"6",
                    "评论数":"3", ]),
                
                Cartoon(name:"昭和元禄落语心中[完]",id:"1540",info:[ "类型":"1",
                    "当前集数":"13",
                    "字幕组":"HKACG feat. PNT",
                    "更新时间":"2016-04-19 15:29:49",
                    "下载量":"303",
                    "当前状态":"完结",
                    "本周下载量":"1",
                    "评论数":"0",]),
                
                Cartoon(name:"无彩限的怪灵世界[完]",id:"1535",info:["类型":"1",
                    "当前集数":"13",
                    "字幕组":"SumiSora",
                    "更新时间":"2016-04-07 16:07:20",
                    "下载量":"1028",
                    "当前状态":"完结",
                    "本周下载量":"22",
                    "评论数":"4", ]),
                
                Cartoon(name:"传颂之物 虚伪的假面[完]",id:"1539",info:[ "类型":"1",
                    "当前集数":"25",
                    "字幕组":"SumiSora&amp;FLsnow",
                    "更新时间":"2016-04-06 17:40:08",
                    "下载量":"614",
                    "当前状态":"完结",
                    "本周下载量":"2",
                    "评论数":"4",])]
    }
}